Revit 2026 API

# AssemblyInstanceAddMemberIds Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddMemberIds(
	ICollection<ElementId> memberIds
)
```
```vb
Public Sub AddMemberIds (
	memberIds As ICollection(Of ElementId)
)
```
```cpp
public:
void AddMemberIds(
	ICollection<ElementId^>^ memberIds
)
```
```fsharp
member AddMemberIds :
        memberIds : ICollection<ElementId> -> unit
```

#### Parameters

memberIds ICollectionElementId

#### Reference

AssemblyInstance Class

Autodesk.Revit.DB Namespace